Autodesk.Revit.DB.Architecture.ContinuousRail.GetSupports
Returns all the railing supports attached to the rail.
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRail.GetEndExtensionPath
Retrieves the start extension path.
Returns:
The start extension path of the rail.
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRail.GetStartExtensionPath
Retrieves the start extension path.
Returns:
The start extension path of the rail.
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRail.GetPath
Retrieves the rail path.
Returns:
The path of the rail.
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRail.HostRailingId
The id of the host Railing that contains this rail.
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRail.Length
The length of the rail.
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRail
Represents a continuous rail element in Autodesk Revit.
Since:
2013